[
  {
    "user_question": "Покажи все видео за последний месяц",
    "clarification_questions": [
      "Какие именно данные о видео вас интересуют? Нужна информация о результатах поражения целей, типах дронов, операторах или что-то другое?",
      "Нужно ли исключить дубликаты видеозаписей из результатов?"
    ]
  },
  {
    "user_question": "Сколько успешных вылетов было?",
    "clarification_questions": [
      "За какой период времени нужно посчитать вылеты?",
      "Какой критерий успешности использовать: вероятность поражения цели от 0.4 и выше, или другой порог?",
      "Нужно ли учитывать дубликаты видеозаписей или исключить их?"
    ]
  },
  {
    "user_question": "Какая эффективность у операторов?",
    "clarification_questions": [
      "За какой период нужно рассчитать эффективность?",
      "Как именно измерять эффективность: среднюю вероятность поражения цели, долю успешных миссий, количество поражённых целей или другой показатель?",
      "Какой порог вероятности поражения считать успешным (например, 0.4 или выше)?",
      "Нужно ли показать всех операторов или только топ операторов? Если топ, то сколько позиций?",
      "Исключать ли дубликаты видео из расчётов?"
    ]
  },
  {
    "user_question": "Покажи топ целей",
    "clarification_questions": [
      "По какому показателю ранжировать цели: по количеству попаданий, по частоте встречаемости, по средней эффективности поражения или по другому критерию?",
      "Сколько позиций в топе нужно показать?",
      "За какой период времени?",
      "Нужны обобщённые классы целей или детальные типы целей, как их указывал оператор?",
      "Учитывать все попытки или только успешные поражения? Если успешные, то какой порог вероятности (например, 0.4)?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Дай статистику по дронам",
    "clarification_questions": [
      "Какую именно статистику по дронам вас интересует: количество вылетов по типам, эффективность разных типов, распределение по частотам связи или что-то другое?",
      "За какой период времени?",
      "Группировать данные по типам дронов или нужна другая детализация?",
      "Исключать ли дубликаты видеозаписей?"
    ]
  },
  {
    "user_question": "Сколько танков было поражено в октябре 2024 года оператором с кодом OP-157?",
    "clarification_questions": [
      "Учитывать все видео с танками в качестве цели или только те, где поражение подтверждено с вероятностью от 0.4 и выше?",
      "Нужно ли исключить дубликаты видео из подсчёта?"
    ]
  },
  {
    "user_question": "Как менялась результативность?",
    "clarification_questions": [
      "За какой период времени нужно проанализировать изменение результативности?",
      "Результативность чего: всех вылетов в целом, конкретных операторов, конкретных типов дронов или чего-то другого?",
      "Как измерять результативность: среднюю вероятность поражения, долю успешных миссий или другой показатель?",
      "С какой детализацией показать динамику: по дням, неделям, месяцам?",
      "Какой порог вероятности считать успешным поражением?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Покажи все видео с БМП",
    "clarification_questions": [
      "За какой период времени?",
      "Нужны видео, где БМП была запланированной целью, или где она была фактически обнаружена системой, или оба варианта?",
      "Исключать ли дубликаты видеозаписей?",
      "Какие данные о видео нужно показать: результаты поражения, информацию об операторе, параметры дрона или что-то ещё?"
    ]
  },
  {
    "user_question": "Сравни этот месяц с прошлым",
    "clarification_questions": [
      "Что именно сравнить: количество вылетов, эффективность поражения целей, типы целей, активность операторов или что-то другое?",
      "Какой показатель эффективности использовать при сравнении: среднюю вероятность поражения, долю успешных миссий (с порогом 0.4), общее количество успешных попаданий?",
      "Нужно ли детализировать сравнение по каким-то группам (операторы, типы дронов, типы целей)?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Какие боеголовки самые эффективные?",
    "clarification_questions": [
      "За какой период времени?",
      "Как измерять эффективность: по средней вероятности поражения цели, по доле успешных применений или по другому критерию?",
      "Какой порог вероятности считать успешным поражением (например, 0.4)?",
      "Нужно ли учитывать типы целей при оценке эффективности или общая статистика?",
      "Показать все типы боеголовок или только топ? Если топ, то сколько позиций?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Дай мне данные",
    "clarification_questions": [
      "Какие именно данные вас интересуют: информация о вылетах, результаты поражения целей, данные об операторах, характеристики дронов или что-то другое?",
      "За какой период времени?",
      "Нужны все записи или данные с определённой фильтрацией?",
      "В каком виде представить данные: список записей, агрегированные показатели, динамика по времени?",
      "Исключать ли дубликаты видеозаписей?"
    ]
  },
  {
    "user_question": "Сколько всего было вылетов с 1 по 15 ноября 2024 года с использованием дронов типа Mavic с боеголовкой VOG-17 по целям типа БТР, где вероятность поражения составила 0.6 и выше, без учёта дубликатов?",
    "clarification_questions": []
  },
  {
    "user_question": "Что происходило вчера?",
    "clarification_questions": [
      "Какую информацию о вчерашних событиях вас интересует: количество вылетов, их результативность, типы целей, активные операторы или что-то другое?",
      "Нужны конкретные записи или агрегированные показатели?",
      "Исключать ли дубликаты видеозаписей?"
    ]
  },
  {
    "user_question": "Покажи лучшие результаты",
    "clarification_questions": [
      "Лучшие результаты чего: операторов, типов дронов, типов боеголовок, экипажей или чего-то другого?",
      "По какому критерию определять лучшие: наибольшая вероятность поражения, наибольшее количество успешных миссий, наибольшее количество вылетов или другой показатель?",
      "За какой период времени?",
      "Сколько позиций в топе показать?",
      "Какой порог вероятности поражения считать успешным (например, 0.4)?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Найди проблемные случаи",
    "clarification_questions": [
      "Что считать проблемными случаями: миссии с низкой вероятностью поражения (ниже какого порога?), вылеты с ошибками обработки, конкретные статусы выполнения миссии или что-то другое?",
      "За какой период времени искать?",
      "Нужны конкретные записи или агрегированная статистика по проблемным случаям?",
      "Исключать ли дубликаты видеозаписей?"
    ]
  },
  {
    "user_question": "Какая динамика по целям?",
    "clarification_questions": [
      "За какой период времени нужно построить динамику?",
      "Динамика чего именно: количества атакованных целей, разнообразия типов целей, эффективности поражения целей или чего-то другого?",
      "С какой детализацией по времени показать динамику: по дням, неделям, месяцам?",
      "Нужна динамика по всем целям в целом или по отдельным типам целей?",
      "Использовать обобщённые классы целей или детальные типы целей?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Сколько раз использовались разные частоты?",
    "clarification_questions": [
      "Какие частоты имеются в виду: частоты видеопередатчика, частоты управления или обе?",
      "За какой период времени?",
      "Нужно просто подсчитать количество использований каждой частоты или также показать их эффективность?",
      "Исключать ли дубликаты видео из подсчёта?"
    ]
  },
  {
    "user_question": "Покажи информацию по экипажам",
    "clarification_questions": [
      "Какую информацию по экипажам вас интересует: количество вылетов, эффективность, используемое оборудование или что-то другое?",
      "За какой период времени?",
      "Нужна информация по всем экипажам или по конкретным? Если по конкретным, то по каким?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Есть ли связь между типом боеголовки и успехом?",
    "clarification_questions": [
      "За какой период анализировать связь?",
      "Как определять успех: по вероятности поражения (какой порог?), по статусу выполнения миссии или как-то иначе?",
      "Нужно ли учитывать типы целей при анализе связи или общая статистика?",
      "Какой формат результата: сравнительная таблица эффективности разных боеголовок, статистический показатель корреляции или что-то другое?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Сколько дубликатов в системе?",
    "clarification_questions": [
      "Нужно общее количество пар дубликатов, количество уникальных файлов, имеющих дубликаты, или количество дублирующих файлов?",
      "За какой период времени считать дубликаты или среди всех видео?",
      "Нужна просто цифра или детализация по датам, операторам или другим параметрам?"
    ]
  },
  {
    "user_question": "Покажи среднюю эффективность по операторам за последние 3 месяца для целей типа танк, где использовались дроны Mavic, при пороге успешности 0.5, топ-20 операторов по количеству вылетов, без дубликатов",
    "clarification_questions": []
  },
  {
    "user_question": "Какие тренды?",
    "clarification_questions": [
      "Тренды в каких показателях интересуют: в эффективности поражения, в типах используемых дронов, в типах атакуемых целей, в активности операторов или в чём-то другом?",
      "За какой период времени анализировать тренды?",
      "С какой временной детализацией показать тренды: по дням, неделям, месяцам?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Дай отчёт",
    "clarification_questions": [
      "Какой отчёт нужен: по вылетам, по эффективности, по операторам, по целям, общий сводный или какой-то специфический?",
      "За какой период времени?",
      "Какие показатели должны быть в отчёте?",
      "Нужна детализация по каким-то группам или общие итоги?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Сколько попаданий было?",
    "clarification_questions": [
      "За какой период времени?",
      "Какой порог вероятности считать успешным попаданием: 0.4, 0.6 или другой?",
      "Нужно общее количество или детализация по каким-то группам (типы целей, операторы, дроны)?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Найди выбросы в данных",
    "clarification_questions": [
      "Выбросы в каких данных ищем: в вероятности поражения, во времени вылетов, в частотах оборудования или в чём-то другом?",
      "За какой период времени анализировать?",
      "Что считать выбросом: значения за пределами 2-3 стандартных отклонений, аномально высокие/низкие значения или что-то другое?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Покажи распределение",
    "clarification_questions": [
      "Распределение чего: вероятности поражения целей, типов целей, типов дронов, операторов, времени вылетов или чего-то другого?",
      "За какой период времени?",
      "Нужно общее распределение или с группировкой по каким-то категориям?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Что с целями в первой половине декабря?",
    "clarification_questions": [
      "Какую информацию о целях за первую половину декабря (какого года?) вас интересует: типы целей, количество атак, эффективность поражения или что-то другое?",
      "Нужны детальные типы целей или обобщённые классы?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Кто лучший?",
    "clarification_questions": [
      "Кто имеется в виду: оператор, экипаж, тип дрона или что-то другое?",
      "По какому критерию определять лучшего: наибольшая эффективность поражения, наибольшее количество вылетов, наибольшее количество успешных миссий или другой показатель?",
      "За какой период времени?",
      "Какой порог вероятности поражения считать успешным?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Сколько процентов миссий успешны?",
    "clarification_questions": [
      "За какой период времени?",
      "Какой порог вероятности поражения считать успешной миссией: 0.4, 0.6 или другой?",
      "Нужен общий процент или детализация по группам (операторы, типы дронов, типы целей)?",
      "Исключать ли дубликаты видео из расчёта?"
    ]
  },
  {
    "user_question": "Покажи активность операторов по неделям за ноябрь-декабрь 2024 года",
    "clarification_questions": [
      "Как измерять активность: количество вылетов, количество успешных миссий или другой показатель?",
      "Нужна активность всех операторов или только топ операторов? Если топ, то сколько?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Что использовалось чаще всего?",
    "clarification_questions": [
      "Что имеется в виду: типы дронов, типы боеголовок, типы взрывателей, частоты связи или что-то другое?",
      "За какой период времени?",
      "Показать только самое частое или топ-N? Если топ, то сколько позиций?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Есть ли сезонность?",
    "clarification_questions": [
      "Сезонность в чём: в количестве вылетов, в эффективности, в типах целей или в чём-то другом?",
      "За какой период нужно анализировать для выявления сезонности (нужен достаточно длительный период)?",
      "С какой детализацией показать результаты: по дням недели, месяцам, сезонам года?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Покажи все случаи, где вероятность поражения ниже 0.2",
    "clarification_questions": [
      "За какой период времени?",
      "Какие данные о таких случаях нужно показать: информацию об операторе, типе дрона, цели, дату или всё сразу?",
      "Исключать ли дубликаты видеозаписей?",
      "Нужен полный список или достаточно ограниченного количества записей? Если ограниченного, то сколько?"
    ]
  },
  {
    "user_question": "Сравни разные типы дронов",
    "clarification_questions": [
      "По каким параметрам сравнить дроны: по эффективности поражения целей, по количеству вылетов, по типам атакуемых целей или по другим критериям?",
      "За какой период времени?",
      "Какие конкретно типы дронов сравнить или все имеющиеся в базе?",
      "Какой порог вероятности поражения считать успешным при оценке эффективности?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Дай статистику за сегодня",
    "clarification_questions": [
      "Какую статистику: количество вылетов, эффективность, типы целей, активные операторы или что-то другое?",
      "Нужны общие показатели или детализация по группам?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Какие цели атаковались оператором OP-203 в период с 15 октября по 20 ноября 2024 года?",
    "clarification_questions": [
      "Нужны детальные типы целей (как указывал оператор) или обобщённые классы целей?",
      "Показать все цели или только те, где поражение было успешным (с каким порогом вероятности)?",
      "Исключать ли дубликаты видео?",
      "Нужен список уникальных типов целей или статистика с количеством атак по каждому типу?"
    ]
  },
  {
    "user_question": "Насколько точны данные?",
    "clarification_questions": [
      "Какие именно данные имеются в виду: вероятность поражения цели, статусы выполнения миссий, типы целей или что-то другое?",
      "По каким критериям оценивать точность: наличие ошибок обработки, противоречия между разными полями, полнота заполнения данных или что-то другое?",
      "За какой период анализировать?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Покажи корреляции",
    "clarification_questions": [
      "Корреляции между какими параметрами интересуют: между типом дрона и эффективностью, между типом цели и вероятностью поражения, между оператором и результативностью или между другими параметрами?",
      "За какой период анализировать?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Сколько разных операторов работало?",
    "clarification_questions": [
      "За какой период времени?",
      "Нужно просто количество уникальных операторов или также дополнительная информация о них?",
      "Исключать ли дубликаты видео при подсчёте?"
    ]
  },
  {
    "user_question": "Что происходит с эффективностью за последнее время?",
    "clarification_questions": [
      "Что считать \"последним временем\": последний месяц, неделю, квартал или другой период?",
      "Эффективность чего: всех миссий в целом, конкретных операторов, типов дронов или чего-то другого?",
      "Как измерять эффективность: средняя вероятность поражения, доля успешных миссий или другой показатель?",
      "С какой детализацией показать динамику: по дням, неделям?",
      "Какой порог вероятности считать успешным?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Найди все видео с ошибками обработки",
    "clarification_questions": [
      "За какой период времени?",
      "Какие данные о таких видео нужно показать?",
      "Нужен полный список или достаточно ограниченного количества? Если ограниченного, то сколько?",
      "Исключать ли дубликаты видеозаписей?"
    ]
  },
  {
    "user_question": "Покажи топ-5 экипажей по количеству успешных миссий за последний квартал с порогом успешности 0.4",
    "clarification_questions": [
      "Исключать ли дубликаты видео из подсчёта?"
    ]
  },
  {
    "user_question": "Какая средняя вероятность поражения?",
    "clarification_questions": [
      "За какой период времени?",
      "Общая средняя вероятность или с детализацией по группам (операторы, типы дронов, типы целей)?",
      "Исключать ли из расчёта видео с нулевой или очень низкой вероятностью?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Дай разбивку по целям",
    "clarification_questions": [
      "За какой период времени?",
      "Какую разбивку: количество атак по каждому типу цели, эффективность поражения разных типов целей или что-то другое?",
      "Использовать детальные типы целей или обобщённые классы?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Есть ли проблемы в данных?",
    "clarification_questions": [
      "Какие проблемы ищем: пропущенные значения в важных полях, несоответствия между полями, аномальные значения, дубликаты или что-то другое?",
      "За какой период анализировать данные или проверить всю базу?",
      "Нужен общий отчёт о проблемах или детальный список записей с проблемами?"
    ]
  },
  {
    "user_question": "Покажи вылеты без указания типа цели",
    "clarification_questions": [
      "За какой период времени?",
      "Какие данные о таких вылетах показать?",
      "Нужен полный список или ограниченное количество записей? Если ограниченное, то сколько?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Сколько различных типов боеголовок используется?",
    "clarification_questions": [
      "За какой период времени или за всё время?",
      "Нужно только количество уникальных типов или также статистика использования каждого типа?",
      "Исключать ли дубликаты видео при подсчёте?"
    ]
  },
  {
    "user_question": "Какие операторы работали в ноябре?",
    "clarification_questions": [
      "Ноябрь какого года?",
      "Нужен просто список операторов или также информация об их активности и результативности?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Дай общую картину",
    "clarification_questions": [
      "За какой период времени нужна общая картина?",
      "Какие аспекты включить в общую картину: количество вылетов, эффективность, типы целей, операторы, дроны или что-то конкретное?",
      "Нужна детализация по времени или общие итоги?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Покажи все миссии, где использовался FPV дрон с серийным номером FPV-12345",
    "clarification_questions": [
      "За какой период времени?",
      "Какие данные о миссиях нужно показать?",
      "Исключать ли дубликаты видеозаписей?",
      "Нужен полный список или достаточно ограниченного количества записей?"
    ]
  },
  {
    "user_question": "Сравни утренние и вечерние вылеты",
    "clarification_questions": [
      "За какой период времени?",
      "По каким параметрам сравнить: количество, эффективность, типы целей или что-то другое?",
      "Как определить границу между утренними и вечерними вылетами (во сколько часов)?",
      "Какой порог вероятности считать успешным при оценке эффективности?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Какой процент видео имеет дубликаты?",
    "clarification_questions": [
      "За какой период времени или среди всех видео в базе?",
      "Нужен процент от общего количества видеофайлов, которые имеют хотя бы один дубликат?"
    ]
  },
  {
    "user_question": "Покажи эффективность по дням недели за последние 2 месяца",
    "clarification_questions": [
      "Как измерять эффективность: средняя вероятность поражения, доля успешных миссий или другой показатель?",
      "Какой порог вероятности считать успешным?",
      "Общая эффективность или с детализацией по каким-то группам?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Найди аномалии",
    "clarification_questions": [
      "Аномалии в каких данных: вероятность поражения, время вылетов, частоты оборудования, типы целей или что-то другое?",
      "За какой период искать аномалии?",
      "Что считать аномалией: статистические выбросы, нелогичные сочетания данных, противоречия между полями или что-то другое?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Сколько миссий выполнил экипаж CR-089?",
    "clarification_questions": [
      "За какой период времени?",
      "Считать все миссии или только успешные? Если только успешные, то с каким порогом вероятности поражения?",
      "Исключать ли дубликаты видео из подсчёта?"
    ]
  },
  {
    "user_question": "Покажи использование частот видеопередатчика",
    "clarification_questions": [
      "За какой период времени?",
      "Нужна статистика использования (количество раз каждая частота) или также информация об эффективности на разных частотах?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Какая доля миссий завершена успешно по каждому типу взрывателя за сентябрь-октябрь 2024 года при пороге 0.5?",
    "clarification_questions": [
      "Исключать ли дубликаты видео из расчёта?"
    ]
  },
  {
    "user_question": "Дай прогноз",
    "clarification_questions": [
      "Прогноз чего: количества вылетов, эффективности, типов целей или чего-то другого?",
      "На какой период сделать прогноз?",
      "На основе каких исторических данных (за какой период) строить прогноз?",
      "Исключать ли дубликаты видео из исторических данных?"
    ]
  },
  {
    "user_question": "Покажи все БМП и танки",
    "clarification_questions": [
      "За какой период времени?",
      "Нужны видео, где БМП или танки были запланированной целью, или где они были обнаружены, или оба варианта?",
      "Какие данные показать: только факт наличия таких целей или также результаты поражения, информацию об операторах и дронах?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Есть ли зависимость между частотой управления и результатом?",
    "clarification_questions": [
      "За какой период анализировать?",
      "Какой результат имеется в виду: вероятность поражения цели, успешность миссии или что-то другое?",
      "Какой формат результата: сравнительная статистика по диапазонам частот, корреляционный анализ или что-то другое?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Сколько видео обработано с ошибками?",
    "clarification_questions": [
      "За какой период времени или за всё время?",
      "Нужно только количество или также детали об ошибках?",
      "Исключать ли дубликаты видео из подсчёта?"
    ]
  },
  {
    "user_question": "Покажи топ-10 операторов по средней вероятности поражения за 2024 год, где количество вылетов не менее 20",
    "clarification_questions": [
      "Исключать ли дубликаты видео из расчётов?"
    ]
  },
  {
    "user_question": "Какие дроны используются реже всего?",
    "clarification_questions": [
      "За какой период времени?",
      "Показать только самый редкий тип или несколько самых редких? Если несколько, то сколько?",
      "Нужна только информация о типах дронов или также причины редкого использования (например, низкая эффективность)?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Дай breakdown",
    "clarification_questions": [
      "Breakdown чего: вылетов, целей, операторов, эффективности или чего-то другого?",
      "По каким категориям делать разбивку: по времени, по типам, по операторам или по другим параметрам?",
      "За какой период времени?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Покажи все вылеты оператора OP-156 по целям типа БМП в октябре 2024 с использованием дронов Mavic, где вероятность поражения от 0.3 до 0.7, отсортированные по дате в порядке убывания, без дубликатов, топ-30 записей",
    "clarification_questions": []
  },
  {
    "user_question": "Что изменилось?",
    "clarification_questions": [
      "Изменилось по сравнению с чем: с предыдущим периодом, с определённой датой, с началом наблюдений?",
      "Изменения в чём: в количестве вылетов, эффективности, типах целей, операторах или в чём-то другом?",
      "За какой период анализировать изменения?",
      "С какой детализацией показать изменения: общие итоги или динамика по времени?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Сколько попыток было по каждой цели?",
    "clarification_questions": [
      "За какой период времени?",
      "Использовать детальные типы целей или обобщённые классы?",
      "Нужно количество всех попыток или только успешных (с каким порогом вероятности)?",
      "Исключать ли дубликаты видео?",
      "Показать все типы целей или только топ? Если топ, то сколько позиций?"
    ]
  },
  {
    "user_question": "Найди записи без метаданных",
    "clarification_questions": [
      "Отсутствие каких именно метаданных имеется в виду: информации об операторе, типе дрона, цели, времени вылета или любых метаданных?",
      "За какой период искать?",
      "Нужен полный список или ограниченное количество записей?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Покажи вылеты с вероятностью поражения выше 0.9 за последние 30 дней",
    "clarification_questions": [
      "Какие данные о таких вылетах показать: информацию об операторе, типе дрона, цели или всё?",
      "Исключать ли дубликаты видеозаписей?",
      "Нужен полный список или достаточно ограниченного количества записей?"
    ]
  },
  {
    "user_question": "Сравни эффективность в будние и выходные дни",
    "clarification_questions": [
      "За какой период времени?",
      "Как измерять эффективность: средняя вероятность поражения, доля успешных миссий или другой показатель?",
      "Какой порог вероятности считать успешным?",
      "Общая эффективность или с детализацией по группам (операторы, дроны, цели)?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Какие самые частые комбинации боеголовка-взрыватель?",
    "clarification_questions": [
      "За какой период времени?",
      "Показать только самую частую комбинацию или топ комбинаций? Если топ, то сколько позиций?",
      "Нужна только частота использования или также информация об эффективности этих комбинаций?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Дай метрики",
    "clarification_questions": [
      "Какие метрики нужны: общая эффективность, количество вылетов, статистика по целям, активность операторов или что-то конкретное?",
      "За какой период времени?",
      "Нужны общие метрики или с детализацией по группам?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Покажи все случаи где цель - техника",
    "clarification_questions": [
      "За какой период времени?",
      "Какую именно технику имеется в виду: бронетехнику (танки, БМП, БТР), автомобильную технику, артиллерию или любую технику?",
      "Нужны все попытки или только успешные поражения (с каким порогом вероятности)?",
      "Какие данные показать о таких случаях?",
      "Исключать ли дубликаты видео?",
      "Нужен полный список или ограниченное количество записей?"
    ]
  },
  {
    "user_question": "Сколько уникальных комбинаций оператор-дрон существует?",
    "clarification_questions": [
      "За какой период времени или за всё время?",
      "Нужно только количество уникальных комбинаций или также информация о каждой комбинации?",
      "Исключать ли дубликаты видео при подсчёте?"
    ]
  },
  {
    "user_question": "Какая тенденция по успешности за год?",
    "clarification_questions": [
      "За какой год?",
      "Как измерять успешность: доля миссий с вероятностью поражения выше порога, средняя вероятность поражения или другой показатель?",
      "Какой порог вероятности считать успешным (например, 0.4)?",
      "С какой детализацией показать тенденцию: по месяцам, неделям, кварталам?",
      "Общая тенденция или с разбивкой по группам (операторы, дроны, цели)?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Покажи статистику по взрывателям за последний квартал",
    "clarification_questions": [
      "Какую статистику по взрывателям: количество использований каждого типа, эффективность разных типов или что-то другое?",
      "Если эффективность, то какой порог вероятности поражения считать успешным?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Есть ли выбросы по времени вылетов?",
    "clarification_questions": [
      "За какой период анализировать?",
      "Что считать выбросами: необычное время суток для вылетов, аномально длительные или короткие интервалы между вылетами или что-то другое?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Покажи топ-15 типов целей по количеству атак за весь период наблюдений без учёта дубликатов",
    "clarification_questions": [
      "Использовать детальные типы целей (как указывал оператор) или обобщённые классы целей?",
      "Учитывать все атаки или только успешные (с каким порогом вероятности)?"
    ]
  },
  {
    "user_question": "Дай insights по данным",
    "clarification_questions": [
      "Какие аспекты данных интересуют для анализа: эффективность, тренды, аномалии, паттерны, корреляции или что-то конкретное?",
      "За какой период анализировать?",
      "Нужны общие insights или фокус на конкретных областях (операторы, дроны, цели)?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Сколько миссий не завершено?",
    "clarification_questions": [
      "За какой период времени?",
      "Как определять незавершённость: по низкой вероятности поражения (ниже какого порога?), по статусу выполнения миссии или как-то иначе?",
      "Нужно общее количество или детализация по причинам незавершённости, операторам, типам дронов?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Покажи распределение вероятности поражения",
    "clarification_questions": [
      "За какой период времени?",
      "Нужно общее распределение или с группировкой по категориям (операторы, дроны, типы целей)?",
      "В каком виде представить распределение: гистограмма с диапазонами вероятности, процентили, статистические показатели?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Найди все миссии с противоречивыми данными",
    "clarification_questions": [
      "Какие противоречия имеются в виду: между статусом выполнения миссии и вероятностью поражения, между типом цели в разных полях, между временными метками или что-то другое?",
      "За какой период искать?",
      "Какие данные показать о противоречивых миссиях?",
      "Исключать ли дубликаты видео?",
      "Нужен полный список или ограниченное количество записей?"
    ]
  },
  {
    "user_question": "Какая активность по часам суток?",
    "clarification_questions": [
      "За какой период времени анализировать?",
      "Как измерять активность: количество вылетов, эффективность или что-то другое?",
      "Нужна общая картина по всем часам или фокус на определённом времени суток?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Покажи сравнение эффективности всех операторов за ноябрь 2024 года с минимум 10 вылетами, где использовались танки как цели, порог успешности 0.6, без дубликатов, отсортированное по средней вероятности поражения по убыванию",
    "clarification_questions": []
  },
  {
    "user_question": "Что можно улучшить?",
    "clarification_questions": [
      "Улучшить в каких аспектах: в эффективности поражения целей, в качестве данных, в работе операторов или в чём-то другом?",
      "На основе анализа каких данных искать возможности для улучшения (за какой период)?",
      "Нужны конкретные рекомендации или анализ проблемных областей?",
      "Исключать ли дубликаты видео из анализа?"
    ]
  },
  {
    "user_question": "Дай KPI",
    "clarification_questions": [
      "Какие KPI нужны: общая эффективность, количество вылетов, доля успешных миссий, активность операторов или конкретные показатели?",
      "За какой период времени?",
      "Нужны общие KPI или с детализацией по группам (операторы, дроны, типы целей)?",
      "Какой порог вероятности поражения использовать для расчёта успешности?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Покажи все данные по частотам",
    "clarification_questions": [
      "Какие частоты: частоты видеопередатчика, частоты управления или обе?",
      "За какой период времени?",
      "Какие данные по частотам: статистика использования, распределение, связь с эффективностью или что-то другое?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Сколько раз атаковались цели типа укрепление?",
    "clarification_questions": [
      "За какой период времени?",
      "Учитывать все атаки или только успешные (с каким порогом вероятности)?",
      "Нужно только количество атак или также дополнительная статистика (эффективность, используемые дроны, операторы)?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Какие паттерны в данных?",
    "clarification_questions": [
      "Паттерны в каких аспектах данных: во времени вылетов, в сочетаниях оборудования, в эффективности разных операторов, в типах атакуемых целей или в чём-то другом?",
      "За какой период анализировать?",
      "Какого рода паттерны интересуют: временные закономерности, корреляции между параметрами, аномалии или что-то конкретное?",
      "Исключать ли дубликаты видео?"
    ]
  },
  {
    "user_question": "Покажи всё",
    "clarification_questions": [
      "Все данные о чём: о всех вылетах, всех операторах, всех типах дронов, всех целях или о чём конкретно?",
      "За какой период времени или за всё время наблюдений?",
      "В каком виде представить данные: общая статистика, детальные записи, агрегированные показатели?",
      "Учитывая потенциально большой объём данных, нужно ли ограничить результаты? Если да, каким образом?",
      "Исключать ли дубликаты видео?"
    ]
  }
]